tutorials/flexiblePlate/system/solid/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/solid";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../../constant/include/CaseSetupValue";

vertices
(
    ( 0      0  0)
    ($width  0  0)
    ($width  $h 0)
    ( 0      $h 0)

    ( 0      0  0.05)
    ($width  0  0.05)
    ($width  $h 0.05)
    ( 0      $h 0.05)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (4 40 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    Free
    {
        type patch;
        faces
        (
            (0 4 5 1)
        );
    }
    InterfaceSolid
    {
        type solid;
        faces
        (
            (4 7 3 0)
            (3 2 6 7)
            (1 2 6 5)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //

