tutorials/flexiblePlate/constant/fluid/physicsSolverDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/fluid";
    object      physicsSolver;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

physicsSolver         HiSAPhysicsSolver;

// ************************************************************************* //
