tutorials/flexiblePlate/constant/solid/mechanicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/solid";
    object      mechanicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../../constant/include/CaseSetupValue";

rho    rho [1 -3 0 0 0 0 0] $rhos;

nu      nu [0 0 0 0 0 0 0] $nu;

E       E [1 -1 -2 0 0 0 0] $E;

alpha   alpha [0 0 0 -1 0 0 0] $alpha;

T0      T0 [0 0 0 1 0 0 0] $T;

thermalStress   yes;
//thermalStressOnly yes;

planeStress     yes;


// ************************************************************************* //
