tutorials/flexiblePlate/0/fluid/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../../constant/include/CaseSetupValue";

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform ($U 0 0);

boundaryField
{
    Inlet
    {
        type        characteristicVelocityInletOutletVelocity;
        U           ( $U 0.0 0.0 );
        p           $P;
        T           $T;
        value       uniform $U;
    }

    Outlet
    {
        type        characteristicPressureInletOutletVelocity;
        U           ( $U 0.0 0.0 );
        p           $P;
        T           $T;
        value       uniform $U;                                                                                                                                                
    }

    "Bottom|Top"
    {
        type    symmetryPlane;
    }

    InterfaceFluid
    {
        type            movingWallVelocity;
    value        uniform (0 0 0);
    }

    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
