tutorials/flexiblePlate/0/fluid/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../../constant/include/CaseSetupValue";

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform $P;

boundaryField
{
    Inlet
    {
    type        characteristicVelocityInletOutletPressure;
        U           ( $U 0.0 0.0 );
        p           $P;
        T           $T;
        value       $internalField;
    }

    Outlet
    {
    type        characteristicPressureInletOutletPressure;
        U           ( $U 0.0 0.0 );
        p           $P;
        T           $T;
        value       $internalField;
    }

    "Bottom|Top"
    {
        type    symmetryPlane;
    }

    InterfaceFluid
    {
    type        characteristicWallPressure;
        value       $internalField;
    }

    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
