tutorials/flexiblePlate/0/fluid/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../../constant/include/CaseSetupValue";

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    "Inlet|Outlet"
    {
        type        calculated;
        value       $internalField;
    }

    "Bottom|Top"
    {
        type    symmetryPlane;
    }

    InterfaceFluid
    {
        type        compressible::alphatWallFunction;
    Prt        0.85;
        value       uniform 0;
    }

    defaultFaces
    {
        type        empty;
    }
}

// ************************************************************************* //
