tutorials/flexiblePlate/0/fluid/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    "Inlet|Outlet|Bottom|Top"
    {
        type            fixedValue;
        value           $internalField;
    }

    InterfaceFluid
    {
        type            fsiInterfaceDisplacement;
        solidRegion     solid;
        solidPatch      InterfaceSolid;
        value           uniform (0 0 0);
        radialExtrapolation
        {
            method "radialExtrapolationNNI";
            pointSelectionDict
            {
        method pointSelectionNearestPoint;
            }
        }
    }

    defaultFaces
    {
        type            empty;
    }
}
// ************************************************************************* //
