tutorials/flexiblePlate/0/solid/D
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      D;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    InterfaceSolid
    {
        type            fsiInterfaceTraction;
        traction        uniform (0 0 0);
        pressure        uniform 0;
        fluidRegion     fluid;
        fluidPatch      InterfaceFluid;
        value           uniform (0 0 0);
        radialExtrapolation
        {
            method  "radialExtrapolationNNI";
            pointSelectionDict
            {
                method pointSelectionNearestPoint;
            }
        }
    }

    Free
    {
        type    fixedValue;
        value uniform (0 0 0);
    }

    FrontBack
    {
      type empty;
    }
}

// ************************************************************************* //
