tutorials/flexiblePlate/system/solid/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/solid";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


ddtSchemes
{
    // Dynamic refinement requires Euler scheme
    default     Euler;
    // default     backward;
}

gradSchemes
{
    default         Gauss linear;
    //grad(DU)         leastSquares;
    //grad(T)         leastSquares;
}

divSchemes
{
    default         Gauss linear;
    //div(sigmaD)     Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
   // laplacian(DD,D) Gauss linear corrected;
   // laplacian(DT,T) Gauss linear compact;
}

interpolationSchemes
{
    default         harmonic;
}

snGradSchemes
{
    default         none;
}

// ************************************************************************* //
